Revit 2027 API
ExternalServices.BuiltInExternalServices.SiteInsertService Property
 The external service which permits registration of an alternate implementation for Site insert.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId SiteInsertService { get; }
Public Shared ReadOnly Property SiteInsertService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ SiteInsertService {
	ExternalServiceId^ get ();
}
static member SiteInsertService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace